In [58]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [59]:
arr = np.random.randn(5,4)
df = pd.DataFrame(arr,index=[1,2,3,4,5],columns='A B D E'.split())
df

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001
4  0.188695 -0.758872 -0.933237  0.955057
5  0.190794  1.978757  2.605967  0.683509

In [60]:
df['B']

1    0.628133
2   -0.319318
3    0.740122
4   -0.758872
5    1.978757
Name: B, dtype: float64

In [61]:
df[['B','D']]

          B         D
1  0.628133  0.907969
2 -0.319318 -0.848077
3  0.740122  0.528813
4 -0.758872 -0.933237
5  1.978757  2.605967

In [62]:
df['B']

1    0.628133
2   -0.319318
3    0.740122
4   -0.758872
5    1.978757
Name: B, dtype: float64

**Creating a new column:**

In [63]:
df['B + D'] = df['B'] + df['D']
df

          A         B         D         E     B + D
1  2.706850  0.628133  0.907969  0.503826  1.536102
2  0.651118 -0.319318 -0.848077  0.605965 -1.167395
3 -2.018168  0.740122  0.528813 -0.589001  1.268936
4  0.188695 -0.758872 -0.933237  0.955057 -1.692109
5  0.190794  1.978757  2.605967  0.683509  4.584725

**Removing Columns:**

In [64]:
df.drop('B + D',axis=1,inplace=True)
df

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001
4  0.188695 -0.758872 -0.933237  0.955057
5  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [65]:
df.drop(1,axis=0)

          A         B         D         E
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001
4  0.188695 -0.758872 -0.933237  0.955057
5  0.190794  1.978757  2.605967  0.683509

**Selecting Rows :**

In [66]:
df.loc[2]

A    0.651118
B   -0.319318
D   -0.848077
E    0.605965
Name: 2, dtype: float64

Or select based off of position instead of label

In [67]:
df.iloc[2]

A   -2.018168
B    0.740122
D    0.528813
E   -0.589001
Name: 3, dtype: float64

In [73]:
df.loc[[1,2]]

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965

** Selecting subset of rows and columns **

In [72]:
df.loc[[1,2],['A','B']]

          A         B
1  2.706850  0.628133
2  0.651118 -0.319318

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [74]:
df

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001
4  0.188695 -0.758872 -0.933237  0.955057
5  0.190794  1.978757  2.605967  0.683509

In [75]:
df>0

       A      B      D      E
1   True   True   True   True
2   True  False  False   True
3  False   True   True  False
4   True  False  False   True
5   True   True   True   True

In [76]:
df[df>0]

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
2  0.651118       NaN       NaN  0.605965
3       NaN  0.740122  0.528813       NaN
4  0.188695       NaN       NaN  0.955057
5  0.190794  1.978757  2.605967  0.683509

In [77]:
# Menampilkan dataframe dengan kondisi D>0
df[df['D']>0]

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
3 -2.018168  0.740122  0.528813 -0.589001
5  0.190794  1.978757  2.605967  0.683509

In [78]:
# Menampilkan dataframe D dengan kondisi B>0
df['D'][df['B']>0]

1    0.907969
3    0.528813
5    2.605967
Name: D, dtype: float64

In [79]:
# Menampilkan dataframe A dan E dengan kondisi D>0
df[['A','E']][df['D']>0]

          A         E
1  2.706850  0.503826
3 -2.018168 -0.589001
5  0.190794  0.683509

For two conditions you can use | and & with parenthesis:

In [0]:
# Menampilkan dataframe dengan kondisi D>0 dan A>1
df[(df['D']>0) & (df['A']>1)]

         A         B         D         E
1  2.70685  0.628133  0.907969  0.503826

In [0]:
# Menampilkan dataframe dengan kondisi D>0 atau A>1
df[(df['D']>0) | (df['A']>1)]

          A         B         D         E
1  2.706850  0.628133  0.907969  0.503826
3 -2.018168  0.740122  0.528813 -0.589001
5  0.190794  1.978757  2.605967  0.683509

In [86]:
df.reset_index()
newind = 'JOG CLP JKT SMG SBY'.split()
df['Kota'] = newind
df.set_index('Kota')

             A         B         D         E
Kota
JOG   2.706850  0.628133  0.907969  0.503826
CLP   0.651118 -0.319318 -0.848077  0.605965
JKT  -2.018168  0.740122  0.528813 -0.589001
SMG   0.188695 -0.758872 -0.933237  0.955057
SBY   0.190794  1.978757  2.605967  0.683509

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods.

In [87]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [110]:
# Load data file example.csv
data = pd.read_csv('example.csv')
data

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [90]:
# Save data example.csv dengan nama laim
data.to_csv('exp_example.csv',index=False)

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects.
we will read tables about indonesian province from this link: [Province](https://id.wikipedia.org/wiki/Daftar_pulau_di_Indonesia_menurut_provinsi)

In [117]:
data = pd.read_html('https://id.wikipedia.org/wiki/Demografi_Indonesia')
prov = data[2]

In [118]:
prov.head(10)

,Kode BPS,Lambang,Nama,Kode ISO[3],Ibu kota,Populasi[4],Luas (km²)[5],Status khusus,Pulau
0,11,NaN,Aceh,ID-AC,Banda Aceh,4.494.410,56.50051,Daerah khusus,Sumatra
1,12,NaN,Sumatra Utara,ID-SU,Medan,12.982.204,72.42781,NaN,Sumatra
2,13,NaN,Sumatra Barat,ID-SB,Padang,4.846.909,42.22465,NaN,Sumatra
3,14,NaN,Riau,ID-RI,Pekanbaru,5.538.367,87.84423,NaN,Sumatra
4,15,NaN,Jambi,ID-JA,Jambi,3.092.265,45.34849,NaN,Sumatra
5,16,NaN,Sumatra Selatan,ID-SS,Palembang,7.450.394,60.30254,NaN,Sumatra
6,17,NaN,Bengkulu,ID-BE,Bengkulu,1.715.518,19.79515,NaN,Sumatra
7,18,NaN,Lampung,ID-LA,Bandar Lampung,7.608.405,37.73515,NaN,Sumatra
8,19,NaN,Kepulauan Bangka Belitung,ID-BB,Pangkal Pinang,1.223.296,16.42414,NaN,Sumatra
9,21,NaN,Kepulauan Riau,ID-KR,Tanjung Pinang,1.679.163,8.08401,NaN,Sumatra

In [119]:
prov[23:34]

,Kode BPS,Lambang,Nama,Kode ISO[3],Ibu kota,Populasi[4],Luas (km²)[5],Status khusus,Pulau
23,65,NaN,Kalimantan Utara,ID-KI,Tanjung Selor,738.163,72.56749,NaN,Kalimantan
24,71,NaN,Sulawesi Utara,ID-SA,Manado,2.270.596,13.93073,NaN,Sulawesi
25,72,NaN,Sulawesi Tengah,ID-ST,Palu,2.635.009,68.08983,NaN,Sulawesi
26,73,NaN,Sulawesi Selatan,ID-SN,Makassar,8.034.776,46.11645,NaN,Sulawesi
27,74,NaN,Sulawesi Tenggara,ID-SG,Kendari,2.232.586,36.75745,NaN,Sulawesi
28,75,NaN,Gorontalo,ID-GO,Gorontalo,1.040.164,12.16544,NaN,Sulawesi
29,76,NaN,Sulawesi Barat,ID-SR,Mamuju,1.158.651,16.78719,NaN,Sulawesi
30,81,NaN,Maluku,ID-MA,Ambon,1.533.506,47.35042,NaN,Maluku
31,82,NaN,Maluku Utara,ID-MU,Sofifi,1.038.087,39.95999,NaN,Maluku
32,91,NaN,Papua Barat,[6],Manokwari,760.422,114.56640,Daerah khusus,Papua
33,94,NaN,Papua,ID-PA,Jayapura,2.833.381,309.93440,Daerah khusus,Papua

### Selecting Data

In [0]:
# Tampilkan data Pulau Sumatra
prov[prov['Pulau'] == 'Sumatra']

   Kode BPS  Lambang  ...  Status khusus    Pulau
0        11      NaN  ...  Daerah khusus  Sumatra
1        12      NaN  ...            NaN  Sumatra
2        13      NaN  ...            NaN  Sumatra
3        14      NaN  ...            NaN  Sumatra
4        15      NaN  ...            NaN  Sumatra
5        16      NaN  ...            NaN  Sumatra
6        17      NaN  ...            NaN  Sumatra
7        18      NaN  ...            NaN  Sumatra
8        19      NaN  ...            NaN  Sumatra
9        21      NaN  ...            NaN  Sumatra

[10 rows x 9 columns]

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [122]:
company = ['Go-Jek','Go-Jek','Tiket','Tiket','AirBnB','AirBnB']
person = ['Irfan','Nusa','Hafizhan','Triano','Ahmad','Rudy']
salary = [360,500,340,124,243,350]
data2 = pd.DataFrame()
data2['Company'] = company
data2['Person'] = person
data2['Salary'] = salary
data2

  Company    Person  Salary
0  Go-Jek     Irfan     360
1  Go-Jek      Nusa     500
2   Tiket  Hafizhan     340
3   Tiket    Triano     124
4  AirBnB     Ahmad     243
5  AirBnB      Rudy     350

In [0]:
# Group by Company mean
data2.groupby('Company').mean()

         Salary
Company
AirBnB    296.5
Go-Jek    430.0
Tiket     232.0

In [0]:
# Group by Company gaji minimum
data2.groupby('Company').min()

           Person  Salary
Company
AirBnB      Ahmad     243
Go-Jek      Irfan     360
Tiket    Hafizhan     124

In [0]:
# Group by Company gaji Maksimum
data2.groupby('Company').max()

         Person  Salary
Company
AirBnB     Rudy     350
Go-Jek     Nusa     500
Tiket    Triano     340

In [126]:
data2.groupby('Company').describe()

        Salary
         count   mean         std    min     25%    50%     75%    max
Company
AirBnB     2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Go-Jek     2.0  430.0   98.994949  360.0  395.00  430.0  465.00  500.0
Tiket      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [127]:
data2.groupby('Company').describe().transpose()

Company           AirBnB      Go-Jek       Tiket
Salary count    2.000000    2.000000    2.000000
       mean   296.500000  430.000000  232.000000
       std     75.660426   98.994949  152.735065
       min    243.000000  360.000000  124.000000
       25%    269.750000  395.000000  178.000000
       50%    296.500000  430.000000  232.000000
       75%    323.250000  465.000000  286.000000
       max    350.000000  500.000000  340.000000